## Plan Result (nonprod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "pnl" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "pnl.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "pnl2.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702686.wl187.sendgrid.net"
              - host  = "em1607.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "20483893" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em1607" -> (known after apply)
      ~ username             = "hmcts-pcol-nonprod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "pnl._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl._domainkey" -> (known after apply)
      ~ name                = "pnl._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "pnl2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl2._domainkey" -> (known after apply)
      ~ name                = "pnl2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl2.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em1607.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em1607" -> (known after apply)
      ~ name                = "em1607" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":69,"Program":"tfcmt","SHA1":"","Target":"nonprod","Vars":{}} -->